using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

//c#은 굉장히 고지식한 객체지향 언어이다.
//c#은 클래스의 노예이다.
//모든길은 클래스로 통한다.
//다른언어는 안그럴수도있는데
//c#이라는 언어는 클래스를 설명하지않고는 
//사실 무엇을 설명한다는것이 의미가 없는 수준.

//객체지향 프로그래밍의 가장 핵심적인 내용 = Class
//Class(클래스를 선언하기위한 키워드) 이름
//{<-클래스의 내용의 시작
//}

//객체지향 -> 내가 표현하고싶은걸 클래스로 만들어서
//그 클래스로 객체를 만드는 프로그래밍
//객체를 기반으로 모든걸 해결하기 때문.
//객체를 지향할 수 밖에 없는 프로그래밍

//구현과 개념이 분리되지않는다.

//내가 생각한 개념이
//내 프로그램에서 사용되어 지기 위한
//설계도를 의미한다.
//코딩에선 무조건 설계도가 먼저다.
//무조건 클래스먼저 객체는 그다음.
